# [ DataFrame 살펴보기 ]
* 데이터를 테이블 즉 표 형태로 저장하는 자료구조 
* 구성 : 행 + 열
* 생성 : pandas.DataFrame() 생성자 메서드

(1) 모듈로딩 --------------------------------------------------------

In [100]:
from pandas import DataFrame

(2) 데이터 준비 -----------------------------------------

In [101]:
data=[[11,22,33],[44,55,66],[77,88,99]]

(3) DataFrame으로 저장 즉, DataFrame 객체 생성 -------------

In [102]:
df1=DataFrame(data)
df1

    0   1   2
0  11  22  33
1  44  55  66
2  77  88  99

(4) DataFrame의 속성 읽기 => 객체변수명.속성명

In [103]:
df1.index  # 세로줄

RangeIndex(start=0, stop=3, step=1)

In [104]:
df1.columns # 가로줄

RangeIndex(start=0, stop=3, step=1)

In [105]:
df1.values # 값 출력

array([[11, 22, 33],
       [44, 55, 66],
       [77, 88, 99]], dtype=int64)

In [106]:
df1.shape # 몇 행 몇 열인지

(3, 3)

In [107]:
df1.ndim # 데이터의 차원정보 n-dimension

2

In [108]:
df1.dtypes # 컬럼 별 데이터 타입

0    int64
1    int64
2    int64
dtype: object

(5) 원소 읽기 => 행과 열 지정 ===> 1개 원소

- 컬럼, 즉 열(Column) 읽기 ==> 객체변수명[인덱스]

In [109]:
df1[0]

0    11
1    44
2    77
Name: 0, dtype: int64

In [110]:
df1[2]

0    33
1    66
2    99
Name: 2, dtype: int64

In [111]:
df1[-1]

KeyError: -1

In [ ]:
## 컬럼변경 ==========================
df1.columns=['A','B','C']
df1

    A   B   C
0  11  22  33
1  44  55  66

In [ ]:
df1['A']

0    11
1    44
Name: A, dtype: int64

In [ ]:
df1.A

0    11
1    44
Name: A, dtype: int64

In [ ]:
df1.columns=[0,1,2]

In [ ]:
df1[0]

0    11
1    44
Name: 0, dtype: int64

0    22
1    55
Name: 1, dtype: int64

In [ ]:
df2=DataFrame([[1,2,3,4,5],[10,20,30,40,50],[100,200,300,400,500],[1000,2000,3000,4000,5000],[10000,20000,30000,40000,50000]],index=["일","이","삼","사","오"])

In [ ]:
# 컬럼 레이블 설정 후 정수 인뎅식 불가!

- 로우 즉 행 (row) 읽기 ==> 방법 2가지
    * 위치 인덱스로 읽기 : 객체변수명.iloc[인덱스]
    * 레이블 인덱스로 읽기 : 객체변수명.loc[인덱스]

In [ ]:
df2

       0      1      2      3      4
일      1      2      3      4      5
이     10     20     30     40     50
삼    100    200    300    400    500
사   1000   2000   3000   4000   5000
오  10000  20000  30000  40000  50000

In [ ]:
df2.loc['일'] # 첫번째 행 출력

0    1
1    2
2    3
3    4
4    5
Name: 일, dtype: int64

In [ ]:
df2.iloc[0] # 첫번째 행 출력

0    1
1    2
2    3
3    4
4    5
Name: 일, dtype: int64

In [ ]:
zeroCol=df2[0]
type(zeroCol)

pandas.core.series.Series

(6) 모든 원소를 한번에 한개씩만 출력

In [ ]:
df2

       0      1      2      3      4
일      1      2      3      4      5
이     10     20     30     40     50
삼    100    200    300    400    500
사   1000   2000   3000   4000   5000
오  10000  20000  30000  40000  50000

In [ ]:
for i in range(df2.shape[0]) :
    for j in range(df2.shape[1]) :
        #print(df2[i][j]) # 그냥 이렇게 해버리면 세로우선으로 출력된다
        print(df2.iloc[i,j])

1
2
3
4
5
10
20
30
40
50
100
200
300
400
500
1000
2000
3000
4000
5000
10000
20000
30000
40000
50000

In [ ]:
for i in df2.index :
    for j in df2.columns:
        #print(df2[j][i])
        print(df2.loc[i][j])

1
2
3
4
5
10
20
30
40
50
100
200
300
400
500
1000
2000
3000
4000
5000
10000
20000
30000
40000
50000

In [ ]:
# 컬럼명 변경 => 객체변수명.columns=새로운컬럼명
df2.columns=['A','B','C','D','E']

In [ ]:
df2

       A      B      C      D      E
일      1      2      3      4      5
이     10     20     30     40     50
삼    100    200    300    400    500
사   1000   2000   3000   4000   5000
오  10000  20000  30000  40000  50000

In [ ]:
df2.loc["일"]['B'], df2.loc["이",'C']

(2, 30)

In [ ]:
df2.iloc[0,1], df2.iloc[1,2]

(2, 30)

In [ ]:
df2.loc["일",'A']

1

In [ ]:
zero = df2.iloc[0]
zero

A    1
B    2
C    3
D    4
E    5
Name: 일, dtype: int64

In [ ]:
zero_column=df2['A']
zero_column

일        1
이       10
삼      100
사     1000
오    10000
Name: A, dtype: int64

In [ ]:
df2.index, df2.columns

(Index(['일', '이', '삼', '사', '오'], dtype='object'),
 Index(['A', 'B', 'C', 'D', 'E'], dtype='object'))

In [ ]:
df2.shape

(5, 5)

In [ ]:
df2.shape[0], df2.shape[1]

(5, 5)

- iloc를 활용한 모든 원소 출력 ==> 행과 열의 정수 번호

In [ ]:
for row in range(df2.shape[0]) :
    for column in range(df2.shape[1]):
        print(df2.iloc[row][column], end=" ")
    print()

1 2 3 4 5
10 20 30 40 50
100 200 300 400 500
1000 2000 3000 4000 5000
10000 20000 30000 40000 50000

- loc를 활용한 모든 원소 출력 ==> 행과 열의 레이블

In [ ]:
for row in df2.index :
    for column in df2.columns :
        print(f'{df2.loc[row][column]:5}', end="")
    print()

    1    2    3    4    5
   10   20   30   40   50
  100  200  300  400  500
 1000 2000 3000 4000 5000
1000020000300004000050000

In [118]:
#### [ 문제 ]  one, there 행을 선택 후 저장
df1=DataFrame([[11,22,33],[44,55,66],[77,88,99]], index=["one","two","three"], columns=["A","B","C"])
df1

        A   B   C
one    11  22  33
two    44  55  66
three  77  88  99

In [127]:
df2=df1.loc[['one','three']] # 리스트에 넣어버리면 된다
df2 # 데이터 프레임으로 잘 저장된다

        A   B   C
one    11  22  33
three  77  88  99